import './advertisement.css';
import './../../styles/text.css';
import './../../styles/common.css';
import { LeftArrowButton, RightArrowButton } from '../elements/Buttons';
import { BlockAdWindow, useModal } from '../modal_window/BlockWindow';

export default function Advertisement() {
    const [ isShowingModal, toggleModal ] = useModal();

    return (
        <div className="advertisement">
            <div className="heading__A2">Новое объявление</div>
          
            <div className="ad__row">
                <div className="ad__photos">
                    <div className="arrows__row">
                        <LeftArrowButton/>
                        <RightArrowButton/>
                    </div>
                </div>

                <div className="ad__info__column">
                    <div className="heading__A2">Заголовок объявления</div>
                    <div className="ad__info__label heading__D1 nunito black">Иван</div>
                    <div className="ad__info__label heading__D1 nunito black">02.02.2023</div>
                    <div className="ad__price roboto__48">844 руб.</div>
                    <div className="ad__category heading__D1 nunito platinum">category 1</div>
                </div>
            </div>
          
            <div className="heading__A2">Описание</div>
            <div className="ad__description heading__D1 nunito">Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание</div>

            <div className="tapbar">
                <button className="action__button button heading__C2">ОПУБЛИКОВАТЬ</button>
                <button className="action__button button heading__C2" onClick={toggleModal}>
                    ЗАБЛОКИРОВАТЬ
                </button>
            </div>
            <BlockAdWindow show={isShowingModal} onCloseButtonClick={toggleModal} />
        </div>
    )
}